# Create Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WallFoundation..::..Create Method
WallFoundation Class See Also
---
Creates a new wall foundation within the project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static WallFoundation Create(
	Document document,
	ElementId typeId,
	ElementId wallId
)
```

Visual Basic
---
```text
Public Shared Function Create ( _
	document As Document, _
	typeId As ElementId, _
	wallId As ElementId _
) As WallFoundation
```

Visual C++
---
```text
public:
static WallFoundation^ Create(
	Document^ document,
	ElementId^ typeId,
	ElementId^ wallId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
typeId
    Type: Autodesk.Revit.DB..::..ElementId The id of the wall foundation type of the newly created wall foundation.
wallId
    Type: Autodesk.Revit.DB..::..ElementId The id of the host wall of the newly created wall foundation.
# ### Return Value
If successful, returns the newly created wall foundation, nullNothingnullptra null reference (Nothing in Visual Basic) otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | typeId is not a valid WallFoundationType id. -or- wallId does not refer to a valid wall. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
WallFoundation Class
Autodesk.Revit.DB Namespace